---
kind: enumMember
id: F:Autodesk.Revit.DB.DetachFromCentralOption.ClearTransmittedSaveAsNewCentral
enum: Autodesk.Revit.DB.DetachFromCentralOption
source: html/4f5d4de3-7c57-890a-e158-329ae1be884b.htm
---
# Autodesk.Revit.DB.DetachFromCentralOption.ClearTransmittedSaveAsNewCentral

After opening the transmitted, workshared model, immediately resave it with its current name
 and clear the transmitted flag.